[{"ID":1,"References":"Page 5\/6","Extracts":"To meet and prepare for these challenges NSW Health must change the\nway it delivers services. NSW Health is implementing a major combined\nclinical and corporate and ICT reform program to address these issues.\nImplementation of IT solutions to support staff and embed business\nprocesses is critical to ensuring change to delivery of services is\nsustainable. To be successful this requires a change in the way that ICT\nsolutions are procured, designed and implemented.\nHistoric investment decisions and decision-making have resulted in Area\nHealth Services developing disparate clinical and corporate applications,\nsupporting mixed infrastructure and integration approaches. This has\nresulted in:\n• Very high integration cost and difficulty gaining a comprehensive\nclinical or management information;\n• Duplication of effort and little reuse of technology assets;\n• Existence of information gaps and overlaps;\n• Different clinical specialty systems making it difficult to effectively\nmanage the patient journey and give clinicians a single view of their\npatients;\n• Twenty-nine systems support basic HR functions;\n• Systems that are more than 20 years old and have limited support.","Facts":"NSW Health is changing how it does things to meet challenges. They're putting in a big program to fix clinical, corporate, and tech stuff. Getting the right IT tools is key to making sure these changes last. Before, they had a mess of different systems which made things harder and more expensive. Plus, some of their systems are ancient and hard to support","Factors":"Performance monitoring\nProcess efficiency","Groups":"System Maintenance and Support\nOperational Effectiveness and Efficiency","Sub Groups":"Responsive Support\nProcess optimization","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary"},{"ID":2,"References":"Page 6","Extracts":"As a result it is difficult to share patient information and coordinate patient\ncare. From a management perspective, it is difficult to obtain accurate\ninformation on system performance. From a financial perspective, the\nsystems are expensive to maintain","Facts":"Because of all this, it's hard to share patient info and coordinate care properly. Managers struggle to get accurate info on how well the systems are doing. And keeping them running costs a lot of money.","Factors":"System interoperability","Groups":"Compliance and Governance","Sub Groups":"Regulatory adherence","Notes\/Additional":null,"Glossary Check":"In Glossary"},{"ID":3,"References":"Page 6","Extracts":"This situation will undermine the long-term sustainability of the Clinical\nServices Redesign and Corporate Shared Services reform programs. The\nICT program has been realigned and refocussed to meet the long terms\nneeds of the reform program. The focus will be on connecting islands of\ninformation and technology and rapidly supporting clinical and corporate\nreform","Facts":"This setup could harm the long-term success of the Clinical Services Redesign and Corporate Shared Services. So, they're reshaping the ICT program to fit these reforms better. They're aiming to connect scattered information and tech and quickly support both clinical and corporate changes.","Factors":"System compatibility\nSystem maintenance\nIntegration capabilities","Groups":"Standardization and Streamlining Processes\nSystem Maintenance and Support\nSystem Deployment and Integration","Sub Groups":"Consistent Excellence\nResponsive Support\nReliable Implementation","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":4,"References":"Page 6","Extracts":"The Integrated Clinical Information Program (ICIP) was established in 2000\nas a result of recommendations of the NSW Health Council and its objective\nis to deal with the issues outlined above in a defined forward strategy. The\nprogram aims to address these issues by providing core clinical\nfunctionality across NSW. Significant progress has been made in the\nimplementation of patient administration, clinical and corporate systems.","Facts":"Back in 2000, the Integrated Clinical Information Program (ICIP) started based on advice from the NSW Health Council. Its goal is to fix the problems with a clear plan. The idea is to give essential clinical features to all of NSW. They've already made big strides in setting up patient administration, clinical, and corporate systems","Factors":"Strategic alignment\nProcess efficiency\nIntegration capabilities\nSustainability initiatives\nCompliance & regulations","Groups":"Business Alignment\nOperational Effectiveness and Efficiency\nSystem Deployment and Integration\nPolicy and Organizational Reform\nCompliance and Governance","Sub Groups":"Strategic Cohesion\nProcess optimization\nReliable Implementation\nGovernance with Integrity\nRegulatory adherence","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":5,"References":"Page 8","Extracts":"1.3 Planned outcomes\nThe ICT Strategy has been realigned with the core reform strategies of\nClinical Services Redesign and Corporate Shared Services. Five major ICT\nstrategies have been defined to support these broader strategic priorities.\nThese are the:\n• Clinical Systems Strategy\n• Corporate Systems Strategy\n• Business Information Strategy\n• Sustainable Infrastructure strategy and\n• Whole of Government ICT Strategic directions","Facts":"Clinical Systems Strategy\nCorporate Systems Strategy\nBusiness Information Strategy\nSustainable Infrastructure Strategy\nWhole of Government ICT Strategic Directions","Factors":"Information flow\nStandardization\nUser-centric optimization","Groups":"Data and Information Management\nOperational Effectiveness and Efficiency\nOperational Effectiveness and Efficiency","Sub Groups":"Data governance\nProcess optimization\nProcess optimization","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":6,"References":"Page 9","Extracts":"Improved quality and safety by ensuring that clinicians have access\nto information they need to provide safe care and by providing systems\nto embed consistent, predictable processes across the state to improve\nquality and safety","Facts":"They're making care safer and better by giving clinicians the info they need and setting up systems for consistent, predictable processes across the state.","Factors":"Collaboration & teamwork\nIntegration capabilities\nInformation flow","Groups":"Collaboration and Communication\nSystem Deployment and Integration\nData and Information Management","Sub Groups":"Teamwork enhancement\nReliable Implementation\nData governance","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":7,"References":"Page 9","Extracts":"Improved collaboration within health and other related agencies within NSW, with the private\nsector and nationally to increase interoperability and better information flow to support improved\npatient outcomes and increased efficiency.","Facts":"They're improving teamwork among health agencies in NSW, as well as with private companies and nationally, so everyone can work together better. This means info flows more smoothly, helping patients and making things more efficient.","Factors":"Process efficiency\nSystem deployment\nSustainability initiatives\nEmployee training","Groups":"Operational Effectiveness and Efficiency\nSystem Deployment and Integration\nPolicy and Organizational Reform\nEmployee Training and Development","Sub Groups":"Process optimization\nReliable Implementation\nGovernance with Integrity\nEmployee development","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":8,"References":"Page 9","Extracts":"Significant savings – new structures, governance arrangements\nand development and deployment methods \n_x0001_ Rapid deployment of core programs will reduce overall project\nmanagement costs, which are the major cost component\n_x0001_ Potential to integrate with the change management activities\nalready in train with CSRP and Corporate Shared Services, reducing\ncost and increasing value of the change management process.\nThis will also help to embed the ICT processes within the clinical\nand corporate reform programs to ensure that the change is\nsustainable.\n_x0001_ Minimises duration of impact on clinicians in AHS’ and increases the\nspeed to delivery of benefits for clinical care\n_x0001_ Reduced training costs (can train once for all components, not\nmultiple times for each individual component)","Facts":"They're expecting to save a lot of money by setting up new structures and ways of doing things. By rolling out key programs quickly, they'll spend less on managing projects, and they can piggyback on existing changes to save even more. This also means less disruption for clinicians and patients and less money spent on training.","Factors":"User support\nStrategic alignment\nFunding & cost control","Groups":"Consumer Experience and Support\nBusiness Alignment\nFinancial Management and Budgeting","Sub Groups":"Customer service\nStrategic Cohesion\nBudget control","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":9,"References":"Page 10","Extracts":"2 The ICT Strategic Management Framework\n2.1 Strategic Themes\nIn summary, the ICT Strategy revolves around three strategic themes:\n• Significantly improved support for clinicians and patient care\n• Strategic alignment to major NSW Health initiatives; and\n• Considerable cost savings.\nThese themes are expressed in terms of five Strategic Objectives\n1. Use of ICT to enable major clinical reform programs;\n2. Reduce the duplication and cost in administrative systems\n3. Deliver a core set of high quality information to all levels of the\norganisation\n4. Build an ICT Infrastructure that is available and responsive and\nsupports the requirements of the clinical and corporate systems\nreforms; and\n5. Adopt a coordinated, portfolio approach to the management of ICT to\nensure that the maximum benefit is gained from NSW Health’s\ninvestment in ICT","Facts":"The ICT Strategy is built on three main ideas:\nBetter support for clinicians and patient care.\nAligning with big NSW Health plans.\nSaving a lot of money.\n\nThese ideas guide five key objectives:\nUsing ICT to drive big changes in clinical care.\nCutting down on duplicated admin systems and costs.\nProviding top-notch info to everyone in the organization.\nSetting up a flexible ICT system that supports both clinical and corporate reforms.\nManaging ICT in a smart, coordinated way to get the most out of the investment.","Factors":"Strategic alignment\nPolicy & governance reform\nInvestment planning\nBusiness reform & strategy","Groups":"Business Alignment\nPolicy and Organizational Reform\nFinancial Management and Budgeting\nBusiness Alignment","Sub Groups":"Strategic Cohesion\nGovernance with Integrity\nBudget control\nStrategic Cohesion","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":10,"References":"Page 11","Extracts":"2.2 Describing the ICT Strategic Management Framework\nThis document provides the central description of NSW Health’s ICT\nStrategy for the period 2006-2011.\nIt is supported by a number of more specific documents covering:\n• The ICT Asset Management Strategy;\n• NSW Health’s Enterprise Architecture. This document forms the core of\nNSW Health’s ICT Architecture documents, that are specific to:\n_x0001_ The Clinical Systems Architecture\n_x0001_ The Corporate Systems Architecture and Strategy\n_x0001_ The Business Information Strategy\n_x0001_ The Infrastructure Strategy; and\n_x0001_ The Integration architecture strategy\n• The ICT Governance Framework\n• The ICT Portfolio Management and Program of work\n• The ICT Investment Plan 2006-2017.","Facts":"ICT Asset Management Strategy\nNSW Health's Enterprise Architecture, which covers:\nClinical Systems Architecture\nCorporate Systems Architecture and Strategy\nBusiness Information Strategy\nInfrastructure Strategy\nIntegration Architecture Strategy\nICT Governance Framework\nICT Portfolio Management and Program of Work\nICT Investment Plan for 2006-2017.","Factors":"Strategic alignment\nRisk identification & mitigation\nProject prioritization","Groups":"Business Alignment\nRisk Identification and Management\nProgram and Project Management","Sub Groups":"Strategic Cohesion\nAccountable Risk Management\nStrategic Project Leadership","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":11,"References":"Page 12","Extracts":"The ICT Strategic Plan is driven by the overarching priorities of NSW Health\nas defined by the Results and Services Plan and NSW Health Plan. To\nensure that the ICT portfolio is closely aligned with the RSP and Corporate\nPlan, NSW Health has taken the following steps:\nFrom the RSP:\n• Selected those results and associated services which will be dependent\non the ICT assets working well\n• Identified ICT asset-related risks which may prevent achievement of\nservices and results\n• Identified those services and service measures which will depend on\nthe ICT assets working well.\nFrom the NSW Health Corporate Plan identified:\n• The ultimate goal or vision for the community\n• The contribution NSW Health will make towards achieving this goal or\nvision\n• The focus for achieving the goal or vision, including intended\noutcomes, risks and strategies\n• Strategies for measuring where performance targets have been met\n• The cost of achieving the goal or vision and meeting performance\ntargets.\nThe outcome of this has informed the development of the ICT portfolio\naimed at effectively supporting services needs.","Facts":"From the RSP:\nThey've picked out results and services that rely on ICT assets.\nThey've identified risks related to ICT assets that could affect service delivery.\nThey've pinpointed services and measures that hinge on ICT assets working properly.\n\nFrom the NSW Health Corporate Plan:\nThey've considered the overall vision for the community.\nThey've outlined how NSW Health will contribute to this vision.\nThey've focused on strategies to achieve goals, along with potential risks.\nThey've set up ways to measure performance and ensure targets are met.\nThey've looked at the costs involved in reaching the vision and meeting targets.","Factors":"Performance monitoring","Groups":"System Maintenance and Support","Sub Groups":"Responsive Support","Notes\/Additional":null,"Glossary Check":"In Glossary"},{"ID":12,"References":"Page 13","Extracts":"2.4 Criteria for inclusion in ICT Strategy and Investment\nPlan\nICT priorities are set and reviewed annually. Each initiative is evaluated\nagainst 5 principles to determine the priority of the project and its position\nin the investment program. The principles are:\n• Level of contribution to major service reform agendas and\nalignment with planned NSW Health Results and Services, priorities\nand plans.\n• Extent to which the project supports the patient journey across\nmultiple care settings and improves the quality and safety of health\ncare for the largest number of people.\n• Capacity to deliver improvements in efficiency and effectiveness in\nhealthcare delivery and workforce utilisation.\n• Degree of conformance with state ICT strategic planning\nrequirements.\n• Level of potential to generate a positive return on investment.","Facts":"    Contribution to major service reform agendas and alignment with planned NSW Health priorities and plans.\n    Support for the patient journey across different care settings and improvement of healthcare quality and safety for a large number of people.\n    Ability to enhance efficiency and effectiveness in healthcare delivery and workforce utilization.\n    Adherence to state ICT strategic planning requirements.\n    Potential to generate a positive return on investment.","Factors":"Inclusion & equity\nScope management\nInvestment planning","Groups":"Data and Information Management\nProgram and Project Management\nFinancial Management and Budgeting","Sub Groups":"Data governance\nStrategic Project Leadership\nBudget control","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":13,"References":"Page 13","Extracts":"2.5 Upgrade process\nIt is intended that only new initiatives should be included in the forward\ninvestment program. The ongoing requirement to replace existing systems\nshould be addressed through the procurement and contractual process to\nensure NSW Health has access to future product upgrades through the\nsupport and maintenance agreements formulated with vendors.","Facts":"They should only add new projects to their investment plan. When it's time to replace old systems, they can handle it through contracts with vendors.","Factors":"Project prioritization\nSystem deployment\nUser support\nPerformance monitoring","Groups":"Program and Project Management\nSystem Deployment and Integration\nConsumer Experience and Support\nSystem Maintenance and Support","Sub Groups":"Strategic Project Leadership\nReliable Implementation\nCustomer service\nResponsive Support","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":14,"References":"Page 14","Extracts":"3 Where we want to be in 2011\nBy 2011 we plan to have implemented the core clinical and corporate\nsystems across NSW to support patient journeys through the health system\nand to provide the corporate systems and management information needed\nto manage the health system efficiently.\nImplementation of the ICT Strategy will deliver benefits at five levels –\nindividual patients and clinicians, Clinical Departments, Hospital, Area wide\nand State.","Facts":"By 2011, they plan to have core clinical and corporate systems set up across NSW. This will help patients move through the healthcare system smoothly and ensure efficient management. Implementing the ICT Strategy will bring benefits to patients, clinicians, departments, hospitals, areas, and the whole state.","Factors":"Collaboration & teamwork\nUser support\nWorkforce sustainability","Groups":"Collaboration and Communication\nConsumer Experience and Support\nSystem Maintenance and Support","Sub Groups":"Teamwork enhancement\nCustomer service\nResponsive Support","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":15,"References":"Page 14","Extracts":"3.1 Benefits to the individual patient and clinician\nFrom a clinical perspective, the end-goal of the strategy is to achieve a\n‘single view of the patient’. The single view of the patient means that every\nclinician involved in the patients care (doctors, nurses, pharmacists,\nphysiotherapists etc…) have a full understanding of the patients complete\ncare needs and medical history. They can understand what other\npractitioners’ roles and contributions are and can work together effectively\nas a team across all parts of the system. Corporate systems are in place to\neffectively support the delivery of clinical care and support s single\nemployee view.","Facts":"For patients and clinicians, the goal is to have a complete picture of the patient's health history. This way, all healthcare providers can work together effectively, knowing each other's roles and contributions. Corporate systems also support this by giving a clear view of employees, making sure care is delivered smoothly","Factors":"User-centric optimization\nService accessibility\nProcess efficiency","Groups":"Operational Effectiveness and Efficiency\nConsumer Experience and Support\nOperational Effectiveness and Efficiency","Sub Groups":"Process optimization\nCustomer service\nProcess optimization","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":16,"References":"Page 14","Extracts":"The strategy benefits the patient as it means that all the information\nclinicians need to deliver the best possible care, with an optimal outcome is\neasily available whenever and wherever it is needed.\nThis helps clinicians by reducing the time they spend trying to locate\ninformation or unnecessarily repeating tests, increasing the time they have\navailable for direct patient care.","Facts":"The strategy benefits patients by ensuring clinicians have all the information they need for optimal care, easily accessible whenever and wherever it's needed. This saves clinicians time by reducing the need to search for information or repeat tests unnecessarily, giving them more time for direct patient care.","Factors":"Resource allocation\nProcess efficiency\nFuture system planning","Groups":"Business Alignment\nOperational Effectiveness and Efficiency\nFuture Planning and System Demand","Sub Groups":"Strategic Cohesion\nProcess optimization\nFutureproofing","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":17,"References":"Page 15","Extracts":"For example a Nursing Unit Manager (NUM) on a ward can more effectively\nplan and care for patients with a full understanding of all demands, such as\npatients waiting in the ED, coming from surgery and being transferred in,\nand of ward capacity such as current available beds, pending available\nbeds, quarantined beds and staff availability and skills sets","Facts":"Nursing Unit Manager (NUM) can plan patient care better when they know all the demands and resources. This includes patients from the emergency room, post-surgery, and transfers, as well as available beds and staff skills.","Factors":"Performance monitoring\nResource allocation\nFunding & cost control","Groups":"System Maintenance and Support\nBusiness Alignment\nFinancial Management and Budgeting","Sub Groups":"Responsive Support\nStrategic Cohesion\nBudget control","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":18,"References":"Page 15","Extracts":"At Hospital, Area and Department executive levels, a complete portfolio\nallows an integrated analysis of health outcome indicators, demand for\nservices, resource availability, clinical and support services performance\nand financial management.","Facts":"At hospital, area, and department executive levels, having a complete portfolio lets them look at health outcomes, service demand, resources, performance, and finances all together.","Factors":"Project prioritization\nResource allocation\nService delivery","Groups":"Program and Project Management\nBusiness Alignment\nOperational Effectiveness and Efficiency","Sub Groups":"Strategic Project Leadership\nStrategic Cohesion\nProcess optimization","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":19,"References":"Page 15","Extracts":"The ICT Strategy is focused on the priority areas or activities required to\nunderpin these and will be addressing them in its forward strategy as\nresources and funding become available. Other initiatives will only be\nadded to the ICT work plan if they do not compromise delivery of these\ncore functions, or to address an urgent issue.","Facts":"The ICT Strategy focuses on key areas and will address them as resources allow. Other initiatives will only be added if they don't affect these core functions or if there's an urgent need.","Factors":"Process efficiency\nUser-centric optimization\nResource allocation\nService accessibility","Groups":"Operational Effectiveness and Efficiency\nOperational Effectiveness and Efficiency\nBusiness Alignment\nConsumer Experience and Support","Sub Groups":"Process optimization\nProcess optimization\nStrategic Cohesion\nCustomer service","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":20,"References":"Page 15","Extracts":"3.2 Department level benefits\nBy 2011 clinical departments will have access to systems that improve work\nflow within the Department, provide decision support for clinicians and\naccess to information needed to support the most effective management of\nresources. This will mean that clinicians will have immediate access to\ncritical information to make sure that the right decisions are made for\npatients. This, combined with rules built into clinical systems and better\ncommunication between staff in the department, will mean better and safer\ncare for patients","Facts":"By 2011, clinical departments will have improved systems for workflow, decision-making support, and accessing necessary information. This helps clinicians make better decisions for patients, leading to safer care","Factors":"System interoperability\nService accessibility\nResource allocation","Groups":"Compliance and Governance\nConsumer Experience and Support\nBusiness Alignment","Sub Groups":"Regulatory adherence\nCustomer service\nStrategic Cohesion","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":21,"References":"Page 15","Extracts":"3.3 Hospital level benefits The implementation of well integrated core systems across a hospital, including for\nexample Results Reporting, Order Management, Patient Administration Systems, Scheduling and Human\nResources means that information can be collected once and be accessible to all who need it. This will\nminimise problems at handover and allow enterprise wide management of human and other resources to increase efficiency and\nreduce access block as patient’s move between departments. Good\ninformation allows the patient journey to be more efficient allowing time to\nsee more patients.","Facts":"Integrated hospital systems mean information is collected once and available to all, reducing handover issues and improving resource management for smoother patient care.","Factors":"Integration capabilities\nService accessibility\nResource allocation\nStandardization\nCollaboration & teamwork","Groups":"System Deployment and Integration\nConsumer Experience and Support\nBusiness Alignment\nOperational Effectiveness and Efficiency\nCollaboration and Communication","Sub Groups":"Reliable Implementation\nCustomer service\nStrategic Cohesion\nProcess optimization\nTeamwork enhancement","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":22,"References":"Page 15\/16","Extracts":"Information & Communication Technology (ICT) Strategy Where we want to be in 2011\n15\nFor example a Nursing Unit Manager (NUM) on a ward can more effectively\nplan and care for patients with a full understanding of all demands, such as\npatients waiting in the ED, coming from surgery and being transferred in,\nand of ward capacity such as current available beds, pending available\nbeds, quarantined beds and staff availability and skills sets.\nAt Hospital, Area and Department executive levels, a complete portfolio\nallows an integrated analysis of health outcome indicators, demand for\nservices, resource availability, clinical and support services performance\nand financial management.\nThe ICT Strategy is focused on the priority areas or activities required to\nunderpin these and will be addressing them in its forward strategy as\nresources and funding become available. Other initiatives will only be\nadded to the ICT work plan if they do not compromise delivery of these\ncore functions, or to address an urgent issue.\n3.2 Department level benefits\nBy 2011 clinical departments will have access to systems that improve work\nflow within the Department, provide decision support for clinicians and\naccess to information needed to support the most effective management of\nresources. This will mean that clinicians will have immediate access to\ncritical information to make sure that the right decisions are made for\npatients. This, combined with rules built into clinical systems and better\ncommunication between staff in the department, will mean better and safer\ncare for patients.\n3.3 Hospital level benefits\nThe implementation of well\nintegrated core systems\nacross a hospital, including for\nexample Results Reporting,\nOrder Management, Patient\nAdministration Systems,\nScheduling and Human\nResources means that\ninformation can be collected\nonce and be accessible to all\nwho need it. This will\nminimise problems at\nhandover and allow enterprise\nwide management of human and other resources to increase efficiency and\nreduce access block as patient’s move between departments. Good\ninformation allows the patient journey to be more efficient allowing time to\nsee more patients.\n3.4 Area level benefits\nAreas will benefit from the implementation of these systems as they will\nhave access to standardised information from all facilities to manage their\nresources more effectively, support planning and demand management and\nmanagement of patient transfers between hospitals in their Area with\nInformation & Communication Technology (ICT) Strategy Where we want to be in 2011\n16\nminimum duplication of diagnostic procedures and delays for patients.\nImproved communication between hospitals and clinicians in the\ncommunity will support patient care better once they leave hospital and\nreduce the risk of readmission","Facts":"The ICT Strategy aims to improve patient care by giving Nursing Unit Managers better information to plan and care for patients, helping hospital executives manage resources and performance, making it easier for departments to access important info and make decisions, integrating key systems across hospitals for smoother patient care, and standardizing information across regions to manage resources and patient transfers more effectively","Factors":"System deployment\nStandardization\nResource allocation\nFuture system planning","Groups":"System Deployment and Integration\nOperational Effectiveness and Efficiency\nBusiness Alignment\nFuture Planning and System Demand","Sub Groups":"Reliable Implementation\nProcess optimization\nStrategic Cohesion\nFutureproofing","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":23,"References":"Page 16","Extracts":"3.5 State level benefits\nImplementation of core systems across NSW will deliver significant\nbenefits. While benefits are derived at each level, the full value of ICT will\nbe achieved when these systems are implemented across all Areas.\nStandardised clinical and corporate information, collected as a by product\nof patient care, provides support for NSW Health to achieve the targets set\nunder the Results and Services Plan by improving patient journeys across\nthe health system, improving timely access to services, strengthening co-\nordination and integration across the health system. Accurate information\nwill allow better utilisation of resources and management of future\ndemand.","Facts":"Rolling out core systems across NSW will have big benefits. Everyone gains, but it's best when the whole state uses them. Standardized info will help NSW Health meet goals by improving patient care, ensuring timely access to services, and better coordination in the health system. Accurate data will help use resources better and manage future needs.","Factors":"Service delivery\nPerformance monitoring\nFuture system planning","Groups":"Operational Effectiveness and Efficiency\nSystem Maintenance and Support\nFuture Planning and System Demand","Sub Groups":"Process optimization\nResponsive Support\nFutureproofing","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":24,"References":"Page 17","Extracts":"A steady increase in demand for services from an ageing population. In\nNSW, the proportion of people over 65 is increasing rapidly. In every\nyear between 2012 and 2028, the aged share of the Australian\npopulation is projected to increase by more than 0.35 percentage\npoints – an increase around 4 times the long term average.","Facts":"A steady increase in demand for services is expected due to an aging population. In NSW, the number of people over 65 is growing quickly. Each year from 2012 to 2028, the percentage of older Australians is projected to rise by over 0.35 points annually, which is about four times the long-term average increase.","Factors":"Workforce sustainability\nRisk identification & mitigation\nResource allocation","Groups":"System Maintenance and Support\nRisk Identification and Management\nBusiness Alignment","Sub Groups":"Responsive Support\nAccountable Risk Management\nStrategic Cohesion","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":25,"References":"Page 17","Extracts":"Staff shortages in critical areas such as nursing and medicine\nHospitals running at maximum capacity","Facts":"Staff shortages in critical areas such as nursing and medicine Hospitals running at maximum capacity","Factors":"Data management\nPerformance monitoring\nFuture system planning","Groups":"Data and Information Management\nSystem Maintenance and Support\nFuture Planning and System Demand","Sub Groups":"Data governance\nResponsive Support\nFutureproofing","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":26,"References":"Page 17","Extracts":"The rate of chronic diseases including heart diseases, pulmonary\ndiseases, diabetes and cancer is increasing. The rate of obesity in our\nyounger population is on the rise and our increasingly globalised\nsociety increases the risk of pandemics","Facts":"The rate of chronic diseases like heart disease, lung disease, diabetes, and cancer is rising. Obesity is becoming more common among young people, and our increasingly globalized society raises the risk of pandemics.","Factors":"Knowledge & content management\nTechnology advancement","Groups":"Data and Information Management\nSystem and Technology Improvement","Sub Groups":"Data governance\nInnovative Evolution","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary"},{"ID":27,"References":"Page 17","Extracts":"An increasing body of medical knowledge that staff cannot manage and\nuse without advanced IT systems","Facts":"An increasing body of medical knowledge that staff cannot manage and\nuse without advanced IT systems","Factors":"Funding & cost control\nTechnology advancement","Groups":"Financial Management and Budgeting\nSystem and Technology Improvement","Sub Groups":"Budget control\nInnovative Evolution","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary"},{"ID":28,"References":"Page 17","Extracts":"Health services are increasingly challenged by more expensive medical technologies and pharmaceuticals","Facts":"Health services are increasingly challenged by more expensive medical technologies and pharmaceuticals","Factors":"Consumer experience\nService delivery\nHigh-risk environment","Groups":"Consumer Experience and Support\nOperational Effectiveness and Efficiency\nRisk Identification and Management","Sub Groups":"Customer service\nProcess optimization\nAccountable Risk Management","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":29,"References":"Page 17","Extracts":"Consumers are becoming more informed, have higher expectations and more complex problems","Facts":"Consumers are becoming more informed, have higher expectations and more complex problems","Factors":"Consumer experience\nService delivery\nHigh-risk environment","Groups":"Consumer Experience and Support\nOperational Effectiveness and Efficiency\nRisk Identification and Management","Sub Groups":"Customer service\nProcess optimization\nAccountable Risk Management","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":30,"References":"Page 17","Extracts":"Quality and safety standards are challenged as demands increase and\nthere are fewer staff to manage them. For example, from 2000 to 2005\nthe average occupancy for NSW hospitals stood at a high 93%. Some\nmetropolitan hospitals’ surgical and medical wards average 95-98%,\nwhen 85% is generally considered a much safer working capacity for\nthese beds.","Facts":"Quality and safety standards are being challenged as demand increases and staff numbers decrease. For instance, from 2000 to 2005, NSW hospitals had an average occupancy of 93%. Some metropolitan hospitals had surgical and medical wards with 95-98% occupancy, while 85% is considered a much safer level.","Factors":"Communication standards\nPolicy & governance reform\nSkills development\nWorkforce sustainability","Groups":"Standardization and Streamlining Processes\nPolicy and Organizational Reform\nEmployee Training and Development\nSystem Maintenance and Support","Sub Groups":"Consistent Excellence\nGovernance with Integrity\nEmployee development\nResponsive Support","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":31,"References":"Page 17","Extracts":"In the period July to December 2007 57,808 incidents were reported.\nThe key factors that cause these adverse events are:\n_x0001_ Communication\n_x0001_ Policies and procedures\n_x0001_ Knowledge, skills and competence issues\n_x0001_ Work scheduling","Facts":"The key factors that cause these adverse events are:\n_x0001_ Communication\n_x0001_ Policies and procedures\n_x0001_ Knowledge, skills and competence issues\n_x0001_ Work scheduling","Factors":"System deployment\nBusiness reform & strategy","Groups":"System Deployment and Integration\nBusiness Alignment","Sub Groups":"Reliable Implementation\nStrategic Cohesion","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary"},{"ID":32,"References":"Page 17","Extracts":"Clinical ICT is becoming an increasingly important enabler of health\nsystem reform, yet the core systems to underpin reform are not\ncurrently in place.","Facts":"Clinical ICT is becoming an increasingly important enabler of health\nsystem reform, yet the core systems to underpin reform are not\ncurrently in place.","Factors":"Integration capabilities","Groups":"System Deployment and Integration","Sub Groups":"Reliable Implementation","Notes\/Additional":null,"Glossary Check":"In Glossary"},{"ID":33,"References":"Page 17","Extracts":"Constraints in capital and recurrent funding, skilled project\nmanagement and implementation resources and capacity of the health\nsystems to accommodate large scale change all restrict the potential\nspeed of implementation of core systems.","Facts":"Constraints in capital and recurrent funding, skilled project\nmanagement and implementation resources and capacity of the health\nsystems to accommodate large scale change all restrict the potential\nspeed of implementation of core systems.","Factors":"Funding & cost control\nSkilled project execution\nWorkforce sustainability","Groups":"Financial Management and Budgeting\nProgram and Project Management\nSystem Maintenance and Support","Sub Groups":"Budget control\nStrategic Project Leadership\nResponsive Support","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":34,"References":"Page 17","Extracts":"There are many competing demands for the funds that are available\nfor ICT. Determining priority and scheduling projects into the forward\nprogram is complex and requires ongoing review to ensure funds\ncontinue to be allocated in areas of greatest potential benefit.","Facts":"There are many competing demands for ICT funds. Deciding which projects to prioritize and schedule is complex and needs ongoing review to ensure funds are allocated where they will be most beneficial.","Factors":"Funding & cost control\nProject prioritization\nScope management","Groups":"Financial Management and Budgeting\nProgram and Project Management\nProgram and Project Management","Sub Groups":"Budget control\nStrategic Project Leadership\nStrategic Project Leadership","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":35,"References":"Page 18","Extracts":"When considered collectively, the convergence of issues creates an\nenvironment of significant risk that must be addressed. The only way NSW\nHealth can realistically meet these challenges is to change the way it\ndelivers services. NSW Health has embarked on a major clinical and\ncorporate reform program to address these issues. The implementation of\nappropriate IT solutions to support staff and embed business processes is\ncritical to ensuring this change is sustainable","Facts":"NSW Health needs to change how it delivers services to meet these challenges. They've started a big reform program and need the right IT solutions to support staff and make these changes last","Factors":"Risk identification & mitigation\nHigh-risk environment\nService delivery","Groups":"Risk Identification and Management\nRisk Identification and Management\nOperational Effectiveness and Efficiency","Sub Groups":"Accountable Risk Management\nAccountable Risk Management\nProcess optimization","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":36,"References":"Page 19","Extracts":"5 Strategic Response to Key Challenges\n5.1 NSW Health Strategic Framework\nThere are a number of key drivers that are influencing NSW Health\nstrategic directions. These relate to both the demand for health services,\ndriven by factors such as the aging population, and supply within health,\nfor example workforce shortages in key areas of the health system. The\nwider government priorities and directions, such as the Council of\nAustralian Government priorities around Mental Health and Health\nworkforce and whole of government ICT strategies also drive the strategic\ndirections and investment decisions of NSW Health","Facts":"NSW Health is responding to big challenges like more people needing healthcare and not enough staff. They're looking at what the government wants, like improving mental health and using better technology. That helps them decide what to do next and where to spend money.","Factors":"Service delivery\nWorkforce sustainability\nGovernment priorities & guidelines\nStrategic alignment","Groups":"Operational Effectiveness and Efficiency\nSystem Maintenance and Support\nBusiness Alignment\nBusiness Alignment","Sub Groups":"Process optimization\nResponsive Support\nStrategic Cohesion\nStrategic Cohesion","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":37,"References":"Page 19","Extracts":"At the highest level, the Results and Services Plan sets the strategic\ndirections for all NSW Health Programs. This is supported by a number of\nstrategic programs aimed at delivering the Results and Services Plan.\nThe ICT Strategic Plan aims to support the Results and Services Plan by\nensuring close alignment with the reform programs and strategies\nunderpinning the Results and Services Plan. All levels of NSW Health\nplanning take into consideration the NSW whole of government and\nNational strategies","Facts":"The Results and Services Plan guides everything in NSW Health. There are other plans helping out too. The ICT Strategic Plan is one of them, making sure it works well with the main plan. They also look at what the whole government and the country are doing.","Factors":"Strategic alignment\nPolicy & governance reform\nBusiness reform & strategy\nGovernment priorities & guidelines","Groups":"Business Alignment\nPolicy and Organizational Reform\nBusiness Alignment\nBusiness Alignment","Sub Groups":"Strategic Cohesion\nGovernance with Integrity\nStrategic Cohesion\nStrategic Cohesion","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":38,"References":"Page 20\/21","Extracts":"5.2 Results and Services Plan (RSP)\nThe RSP represents NSW Health’s primary strategic response to the\nchallenges faced by NSW Health. NSW Health has four primary goals:\n1. To keep people healthy\n2. To provide the health care that people need\n3. To deliver high quality services\n4. To manage health services well\nThese are underpinned by seven key strategic directions:\n• Make prevention everybody’s business\n• Create better experiences for people using health services\n• Strengthen primary health and continuing care in the community\n• Build regional and other partnerships for health.\nMake smart choices about costs and benefits of health services\n• Build a sustainable the health workforce\n• Be ready for new risks and opportunities","Facts":"The RSP is NSW Health's main plan to tackle challenges. They have four main goals:\nKeep people healthy\nProvide needed healthcare\nDeliver top-quality services\nManage health services well\n\nTo achieve these, they focus on seven key directions:\nGet everyone involved in prevention\nImprove people's healthcare experiences\nStrengthen community care\nWork with others for better health\nMake wise choices about healthcare costs\nBuild a strong healthcare workforce\nStay prepared for new challenges and chances","Factors":"Consumer experience\nFuture system planning\nCollaboration & teamwork\nFunding & cost control\nWorkforce sustainability\nRisk identification & mitigation","Groups":"Consumer Experience and Support\nFuture Planning and System Demand\nCollaboration and Communication\nFinancial Management and Budgeting\nSystem Maintenance and Support\nRisk Identification and Management","Sub Groups":"Customer service\nFutureproofing\nTeamwork enhancement\nBudget control\nResponsive Support\nAccountable Risk Management","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":39,"References":"Page 21","Extracts":"5.2.1 Strategic Goal 1: To keep people healthy\nReducing risk factors in the population is a major strategic objective for\nNSW Health. NSW Health is increasing the focus on health promotion and\npreventing illness and implementing strategies to increase immunisation\nrates, reduce the impact of chronic disease, reduce diabetes through\ninterventions for people at high risk. ICT can support many of these\nstrategies by providing automatic alerts about risk factors, such as gaps in\nimmunisations, or overdue screening or check ups.'","Facts":"NSW Health wants to prevent sickness and promote good health habits. They're focusing on getting more people vaccinated and helping those at risk for diseases like diabetes. ICT can help by sending alerts about things like missed vaccinations or overdue check-ups","Factors":"Risk identification & mitigation\nConsumer experience\nPreventative solutions","Groups":"Risk Identification and Management\nConsumer Experience and Support\nFinancial Management and Budgeting","Sub Groups":"Accountable Risk Management\nCustomer service\nBudget control","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":40,"References":"Page 21\/22","Extracts":"5.2.2 Strategic Goal 2 : To provide the healthcare people need\nHealth services need to be available when needed, are effective and co-\nordinated to meet each individual’s needs. ICT plays a major role in\nproviding the tools that are needed to underpin new models of care and\nmake clinical reform sustainable. Supporting information flow along the\npatient journey plays a large part in improving the experience of people as\nthey move along the journey, and making sure that the care they receive is\nappropriate","Facts":"NSW Health wants to make sure everyone gets the care they need, when they need it. They're using tech to support new ways of caring for people and making sure changes stick. Better info during your care journey means a better experience and getting the right care.","Factors":"Service accessibility\nService delivery\nCoordination & support\nSustainability initiatives\nInformation flow\nConsumer experience","Groups":"Consumer Experience and Support\nOperational Effectiveness and Efficiency\nCollaboration and Communication\nPolicy and Organizational Reform\nData and Information Management\nConsumer Experience and Support","Sub Groups":"Customer service\nProcess optimization\nTeamwork enhancement\nGovernance with Integrity\nData governance\nCustomer service","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":41,"References":"Page 23\/24","Extracts":"5.2.3 Strategic Goal 3: To deliver high quality health services\nThere are currently three levels of government and multiple agencies\ninvolved in funding and delivering health services, resulting in complexity\nand duplication. Improved collaboration within and beyond the health\nsystem is vital to improve the links and improve co-ordination and the\nquality of services provided across the health system. ICT provides the\ninfrastructure and tools needed to improve this level of collaboration.\nQuality and safety will also be enhanced through decision support tools for\nclinicians through the Electronic Medical Record, and by more appropriate\nuse of resources through rostering and other HR tools.","Facts":"NSW Health aims to improve healthcare by working better together. They're using tech to help everyone collaborate and use resources wisely. That means better tools for healthcare workers and making sure everyone gets great care.","Factors":"Process efficiency\nCollaboration & teamwork\nCoordination & support\nQuality & safety\nResource allocation","Groups":"Operational Effectiveness and Efficiency\nCollaboration and Communication\nCollaboration and Communication\nOperational Effectiveness and Efficiency\nBusiness Alignment","Sub Groups":"Process optimization\nTeamwork enhancement\nTeamwork enhancement\nProcess optimization\nStrategic Cohesion","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":42,"References":"Page 24","Extracts":"5.3 NSW and National ICT Government Drivers\nThe NSW Government IT environment feeds into, and, to some extent,\nconstrains the NSW Health ICT strategic plan. This program aims to\nensure that NSW strategic initiatives align with, and where possible have\nthe opportunity to inform, national and broader state initiatives","Facts":"The NSW Government's IT setup influences NSW Health's ICT plan. They aim to make sure NSW initiatives match up with and sometimes even help shape national and statewide plans","Factors":"Scope management\nStrategic alignment","Groups":"Program and Project Management\nBusiness Alignment","Sub Groups":"Strategic Project Leadership\nStrategic Cohesion","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary"},{"ID":43,"References":"Page 25","Extracts":"5.3.1 NSW GCIO ICT Strategic Plan\nThe NSW Government has set new directions for IT through the NSW\nGovernment CIO Executive Council. Primary goals include:\n• Using IT to reduce back-end service costs while maintaining frontline\nservices\n• Increasing investment in frontline service technologies\n• Delivering savings through IT strategies in both capital costs and\nrecurrent costs\n• Reducing the total cost of IT\nThe Government has proposed a number of new measures to achieve its\nprimary goals including:\n• A single capital fund for IT\n• A statewide IT plan\nA focus on fewer software applications, shared infrastructure, common\nprocesses and aggregated purchasing","Facts":"The NSW Government is changing how they use computers and stuff. They want to save money on the boring tech stuff while keeping important services running smoothly. They're spending more on technology for important services and finding ways to save money with computers. This means using one fund for all tech needs, having a plan for the whole state, using fewer computer programs, sharing tech, and buying things together.","Factors":"Technology advancement\nStrategic alignment","Groups":"System and Technology Improvement\nBusiness Alignment","Sub Groups":"Innovative Evolution\nStrategic Cohesion","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary"},{"ID":44,"References":"Page 25","Extracts":"5.3.2 Council of Australian Governments\nThe Council of Australian Governments (COAG) has identified significant\nareas of national interest including mental health, health workforce, action\nplans for influenza pandemics and progress towards electronic health\nrecords. ICT is an enabler for many of the COAG priorities. COAG has an\nambitious health and ageing reform agenda proposed for implementation\nfrom 2009. This includes a program of hospital reform, improvements to\nIndigenous health, chronic disease management and preventative health\ncare. The ICT program outlined in this strategy directly supports the COAG\nreform agenda, through its focus on the implementation of systems that\nwill enable clinical reform in both acute and community settings.","Facts":"COAG is a group working on important national stuff like mental health, healthcare workers, flu plans, and electronic health records. They're making big plans for healthcare, like making hospitals better and helping people stay healthy. This ICT plan is part of making those plans work by improving healthcare in hospitals and communities","Factors":"Data sharing & integration","Groups":"Data and Information Management","Sub Groups":"Data governance","Notes\/Additional":null,"Glossary Check":"In Glossary"},{"ID":45,"References":"Page 25","Extracts":"What are the possible solutions that can be implemented to mitigate reaised concerns while maintaing the organizations values ?\nWhat are the possible solutions that can be implemented to mitigate raised concerns while maintaining the organizations values ?","Facts":"The eHealth initiative involves all states, territories, and the Australian Government. It began in 2000 to set up e-health across Australia. The Australian Government has invested $128 million in e-health projects across the country, plus an extra $10 million in 2005 for managed health network grants. The aim is to make sure everyone works together, with consistent approaches to eHealth, creating a national health information network. The program also helps make the right rules for eHealth initiatives.","Factors":"Government priorities & guidelines\nBusiness reform & strategy\nInclusion & equity\nPreventative solutions","Groups":"Business Alignment\nBusiness Alignment\nData and Information Management\nFinancial Management and Budgeting","Sub Groups":"Strategic Cohesion\nStrategic Cohesion\nData governance\nBudget control","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":46,"References":"Page 26","Extracts":"5.3.4 NEHTA\nNEHTA’s primary goal is the development of national health information\nmanagement and communications technology standards and specifications.\nNEHTA is progressing a number of work programs that will have a direct\nimpact on NSW Health’s ICT strategic plan.\nThese include:\neHealth interoperability: developing a Framework for Interoperability to\nenable efficient and secure electronic exchange of information between\nhealth organisations.\nClinical communications: NEHTA is undertaking a program of\nstandardisation of key clinical information. It is intended that the format\nof, and data contained in, clinical communications such as patient referrals\nand hospital discharge summaries will be standardised across all health IT\nsystems, according to the specifications set by NEHTA. These specifications\nwill be built upon existing standards, extending these as necessary. This\nwork includes the establishment of a common, coded clinical language\n(clinical terminology).\nUnique Healthcare Identifiers – This program is developing a single\nNational identifier for individuals accessing healthcare services, providers\nwithin the public and private healthcare systems and health organisations.\nAt least initially, the individual identifier is not expected to be used as the\nprimary identifier by most jurisdictions.\nIndividual Electronic Health Record: NEHTA are preparing the data\nand interoperability standards and business case for the development and\nimplementation of a national electronic health record.\nIdentity management: Standards to ensure the accurate identification\nand secure access of individuals to clinical information.\nSecure messaging: NEHTA is working to define national standards and\nshared infrastructure to ensure that the electronic exchange of clinical\ninformation between healthcare providers is reliable and secure.\nSupply chain: NEHTA has established a National Product Catalogue (NPC)\nto provide a central source of data for the purchase of healthcare products\nwithin health departments in each State and Territory.","Facts":"focuses on developing national health information management and communication technology standards. Its work includes creating frameworks for interoperability, standardizing clinical communications, establishing unique healthcare identifiers, and preparing standards for individual electronic health records, identity management, secure messaging, and supply chain management.","Factors":"Collaboration & teamwork\nStandardization\nData sharing & integration\nCompliance & regulations","Groups":"Collaboration and Communication\nOperational Effectiveness and Efficiency\nData and Information Management\nCompliance and Governance","Sub Groups":"Teamwork enhancement\nProcess optimization\nData governance\nRegulatory adherence","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":47,"References":"Page 27","Extracts":"6..1 Approach to delivery of ICT in NSW\nTo meet and prepare for the challenges it faces NSW Health is\nimplementing changes to the way it delivers services. NSW Health has\nembarked on a major combined clinical and corporate and ICT reform\nprogram to address these issues. Implementation of IT solutions to\nsupport staff and embed business processes is critical to ensuring change\nto delivery of services is sustainable","Facts":"To tackle challenges and prepare for the future, NSW Health is changing how it delivers services. Implementing IT solutions to support staff and integrate business processes is key for sustainable service delivery changes.","Factors":"Compliance & regulations\nStrategic alignment\nSystem interoperability\nStandardization\nData integrity & privacy\nSecure data practices","Groups":"Compliance and Governance\nBusiness Alignment\nCompliance and Governance\nOperational Effectiveness and Efficiency\nData Security, Quality and Privacy\nData Security, Quality and Privacy","Sub Groups":"Regulatory adherence\nStrategic Cohesion\nRegulatory adherence\nProcess optimization\nData integrity\nData integrity","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":48,"References":"Page 27","Extracts":"Strategic Information Management (SIM)\nSIM is responsible for the development of ICT strategy, working with\nstakeholders to determine investment priorities, budget negotiation and\nensuring overall program delivery. SIM’s role includes:\n• Development and maintenance of the NSW ICT Strategic Plan and\ninvestment program\n• Interface with Area Health Services and other key stakeholder\ngroups\n• Business case development and review of Area IM&T proposals\n• overseeing the delivery of the IM&T strategy,\n• Ensuring compliance with government, Departmental and Branch\nstandards, architecture and policies\n• Identify, assess and address the enterprise architecture needs of\nNSW Health by developing and maintaining appropriate policies,\nstandards and procedures for information management.\n• Managing, planning and developing integration strategies,\narchitecture, standards and policies to enable effective and\nconsistent integration of a wide range of systems throughout NSW\nHealth.","Facts":"NEHTA makes sure health info works the same way everywhere in Australia. They're working on stuff like making sure doctors' notes and patient info look the same everywhere. They're also setting up a single ID for healthcare and getting ready for a national health record system. Plus, they're making sure the stuff doctors send each other is safe, and helping with buying healthcare stuff","Factors":"Strategic alignment\nInvestment planning\nFunding & cost control\nProject prioritization","Groups":"Business Alignment\nFinancial Management and Budgeting\nFinancial Management and Budgeting\nProgram and Project Management","Sub Groups":"Strategic Cohesion\nBudget control\nBudget control\nStrategic Project Leadership","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":49,"References":"Page 27","Extracts":"Health Support Services\nHealth Support Services is responsible for the implementation and ongoing\nsupport and maintenance of core clinical and corporate systems. Health\nSupport Services are responsible for providing specific clinical and\ncorporate IT services to the Area Health Services as defined under s126G\nof the Health Services Act 1997. This includes the provision of hardware\nand hardware asset management, software, application support systems\nand system implementation management.","Facts":"Health Support Services sets up and maintains key computer systems for healthcare. They give specific IT help to Area Health Services as defined by the law. This includes managing computers, software, and helping with setting up systems.","Factors":"User support\nSystem deployment\nSystem maintenance","Groups":"Consumer Experience and Support\nSystem Deployment and Integration\nSystem Maintenance and Support","Sub Groups":"Customer service\nReliable Implementation\nResponsive Support","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":50,"References":"Page 28","Extracts":"Area Health Services\nArea Health Services are responsible for the management of local\nimplementations, change management and training of staff and benefits\nrealisation.","Facts":"Area Health Services are responsible for the management of local\nimplementations, change management and training of staff and benefits\nrealisation.","Factors":"Service delivery\nSystem deployment\nSkills development\nBenefit realization","Groups":"Operational Effectiveness and Efficiency\nSystem Deployment and Integration\nEmployee Training and Development\nBusiness Alignment","Sub Groups":"Process optimization\nReliable Implementation\nEmployee development\nStrategic Cohesion","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":51,"References":"Page 31","Extracts":"6.2 Approach to delivery\nA portfolio management approach is used as the basis for prioritising,\nselecting and monitoring programs and projects and making sound\ninvestment decisions that provide the greatest benefit to the health system.\nIt is underpinned by common processes across ICT at a Departmental and\nArea level. The ICT portfolio is managed within a collaborative framework\nthat defines:\n• Processes to determine, develop and manage core, common and\ndivergent applications\n• Application of integrated governance models at Area Health Services\nand the Department\n• State based build approach to core applications to support a faster,\nmore cost effective implementation and to underpin predictable\nprocesses across the whole of NSW.","Facts":"They pick the most important projects and invest wisely for the health system. We work together on ICT stuff and have clear rules. This helps us decide what to build and how to run things","Factors":"Project prioritization\nInvestment planning\nBenefit realization\nStandardization\nCollaboration & teamwork","Groups":"Program and Project Management\nFinancial Management and Budgeting\nBusiness Alignment\nOperational Effectiveness and Efficiency\nCollaboration and Communication","Sub Groups":"Strategic Project Leadership\nBudget control\nStrategic Cohesion\nProcess optimization\nTeamwork enhancement","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":52,"References":"Page 31","Extracts":"What are the possible solutions that can be implemented to mitigate reaised concerns while maintaing the organizations values ?\nWhat are the possible solutions that can be implemented to mitigate raised concerns while maintaining the organizations values ?","Facts":"NSW Health uses a coordinated approach to manage ICT projects. This helps us evaluate, prioritize, select, and monitor programs and projects. We adjust as needed to meet our business goals.","Factors":"Project prioritization\nPerformance monitoring\nStrategic alignment","Groups":"Program and Project Management\nSystem Maintenance and Support\nBusiness Alignment","Sub Groups":"Strategic Project Leadership\nResponsive Support\nStrategic Cohesion","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":53,"References":"Page 32","Extracts":"6.4 Standard processes adopted across the ICT portfolio\nCore processes and standard guidelines for operation underpin the delivery\nof the ICT Strategic Plan. The processes relate to the stages of the project\nlifecycle, while the guidelines identified in the diagram below apply to the\nportfolio as a whole and to individual projects within the portfolio. Details\nfor each of these processes, guidelines and templates can be found on the\nSIM website at http:\/\/internal.health.nsw.gov.au\/sim","Facts":"They have set ways of doing things that support our ICT plan. These cover every step of a project's life.","Factors":"Standardization\nPolicy & governance reform","Groups":"Operational Effectiveness and Efficiency\nPolicy and Organizational Reform","Sub Groups":"Process optimization\nGovernance with Integrity","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary"},{"ID":54,"References":"Page 33","Extracts":"6.5 A framework for Partnership\nFor NSW Health to effectively implement this strategy it must be done as a\ncollaboration between the Department of Health, Area Health Services,\nHealth Technology and third party providers.\nThere are three key components of the collaboration framework. These\nare:\n• Processes to determine, develop and manage core, common and\ndivergent applications;\n• Application of integrated governance models at AHSs and the\nDepartment;\n• State based build approach to core applications to support a faster,\nmore cost effective implementation and to underpin predictable\nprocesses across the whole of NSW","Facts":"To make the strategy work, NSW Health collaborates with the Department of Health, Area Health Services, Health Technology, and third-party providers, using shared decision-making processes and building core applications at the state level","Factors":"Collaboration & teamwork\nPolicy & governance reform\nStandardization","Groups":"Collaboration and Communication\nPolicy and Organizational Reform\nOperational Effectiveness and Efficiency","Sub Groups":"Teamwork enhancement\nGovernance with Integrity\nProcess optimization","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":55,"References":"Page 33","Extracts":"6.5.1 Core, Common and Divergent\nAll applications and associated projects are classified as core, common or\ndivergent. This classification will influence how each project will be\nprioritised, governed, funded, procured, implemented and managed.\nCore: Applications and projects that are expected to provide all\nstate wide core functions. These will be directed,\ncontrolled and funded by the Department.\nCommon: These applications provide common solutions across a\ncollaborative group. They will be controlled collaboratively\nto achieve the desired outcomes for the group.\nDivergent: Applications aimed at innovative solutions to localised\ngroups to enable design flexibility to explore new solutions\nto specific requirements","Facts":"Applications and projects are categorized as core, common, or divergent, influencing their prioritization, funding, and management, with core ones managed by the Department, common ones collaboratively, and divergent ones allowing for innovative solutions to local needs.","Factors":"Data management\nResource allocation\nPerformance monitoring","Groups":"Data and Information Management\nBusiness Alignment\nSystem Maintenance and Support","Sub Groups":"Data governance\nStrategic Cohesion\nResponsive Support","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":56,"References":"Page 34\/35","Extracts":"The purpose of the Project Governance framework is to ensure that\nprojects remain relevant and deliver the stated business benefits. Effective\ngovernance should ensure both that the NSW Health focuses on “doing the\nright projects”, and that the right people focus on “doing the projects\nright”. The governance structure is intended to reduce the risk to the\nportfolio that would occur if there were to be a complete disconnect\nbetween strategy and delivery.","Facts":"The Project Governance framework makes sure projects do what they're supposed to and deliver the benefits they promised. It helps NSW Health focus on the right projects and ensures they're done correctly. This way, strategy and delivery stay connected, reducing risks for the whole portfolio","Factors":"Strategic alignment\nRisk identification & mitigation\nStrategic alignment","Groups":"Business Alignment\nRisk Identification and Management\nBusiness Alignment","Sub Groups":"Strategic Cohesion\nAccountable Risk Management\nStrategic Cohesion","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":57,"References":"Page 36","Extracts":"1. Content Development\nThis phase is characterised by an intense design and build of a prototype,\nfollowed by a series of clinical review sessions. A methodology for the\ndesign and build of SBB content has previously been developed and\nutilised. The Fast Track methodology leverages this approach and adds in\nthe more efficient prototype model. The prototype assists clinicians in\ngaining a better understanding of the application and offers the opportunity\nto view the process as part of an integrated workflow. This approach\nfacilitates informed decision-making.","Facts":"In the Content Development phase, they design and build a prototype, then review it with clinicians. We use a method called Fast Track, which makes the process quicker. The prototype helps clinicians understand the application better and decide if it works for them","Factors":"Project prioritization\nIntegration capabilities\nKnowledge & content management","Groups":"Program and Project Management\nSystem Deployment and Integration\nData and Information Management","Sub Groups":"Strategic Project Leadership\nReliable Implementation\nData governance","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":58,"References":"Page 36\/37","Extracts":"2. Implementation\nThe implementation phase is designed around the State defined content.\nAlthough this introduces a large amount of content in a single project, it\nachieves greater benefit and is more cost effective. The Fast Track Metho\nreduces the time, cost and complexity of implementation by using a\nstandard design with State Build content. Resource constraints and the\nextended learning curve to get AHS staff up to speed that were an inherent\npart of the old methodology, are minimised by the new approach. The\nimplementation team assigned to the project have the application\nknowledge to build the database. A rapid implementation also eliminates\nthe inevitable scope creep that occurs during any long IT project.","Facts":"In the Implementation phase, they're putting in the content decided by the state. Doing it all at once might seem like a lot, but it's the most efficient and cost-effective way. Using the Fast Track Method makes things quicker and cheaper, sticking to a standard design with state content. This means less hassle and less time spent learning for Area Health Services staff. Their team knows how to build the database, and doing things fast helps them stick to the plan without adding extra stuff.","Factors":"Knowledge & content management\nResource allocation\nSkills development\nScope management","Groups":"Data and Information Management\nBusiness Alignment\nEmployee Training and Development\nProgram and Project Management","Sub Groups":"Data governance\nStrategic Cohesion\nEmployee development\nStrategic Project Leadership","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":59,"References":"Page 37\/38","Extracts":"3. SBB Maturity Model\nThe SBB uses a maturity model to progressively enhance the functionality\nof the application as the experience and expectations of users increase.\nThe maturity model is based on the following principles:\n• All Area Health Services contribute to the development of each version\nof the SBB.\n• Version 1.0 of any application is implemented as the SBB.\nEnhancements can be proposed by any Area Health Service, but must\nbe endorsed by the majority of members of the Application Advisory\nGroup (AAG).\n• Every Area Health Service has equal weight in the AAG.\n• Every proposed change must go through a formal change control\nprocess and be reviewed by the AAG, even those that are specific to\none Area (eg establishing the facility codes for hospitals in that Area).\n• The primary function of the AAG is to consider and endorse changes\nfor each version of the SBB. New versions will be released on an\nannual basis.\nSBB functionality can be classified as:\n• Required core: required content and functionality to support common\nbusiness and application functions, including standardised KPIs and\nreporting and a consistent user interface for mobile staff. Required\ncontent must be consistent across all implementations.\n• Modifiable within guidelines to support area specific clinical processes,\nassessments and third party applications\n• Localised content where site specific information is required in the build\n(eg code table for local facilities)","Facts":"The SBB uses a maturity model to improve its features over time, with all Area Health Services contributing to each version, changes requiring approval from the majority of the Application Advisory Group, and new versions released annually, featuring required core functions, modifiable features, and local content.","Factors":"Inclusion & equity\nScope management","Groups":"Data and Information Management\nProgram and Project Management","Sub Groups":"Data governance\nStrategic Project Leadership","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary"},{"ID":60,"References":"Page 39","Extracts":"Information & Communication Technology (ICT) Strategy Priority ICT strategies\n39\n7 Priority ICT strategies\nThe ICT Strategy has been realigned with the core reform strategies of\nClinical Services Redesign and Corporate Shared Services. Five major ICT\nstrategies have been defined to support the broader strategic priorities.\nThese are the Clinical Systems Strategy, the Corporate Systems Strategy,\nBusiness Information Strategy, Sustainable Infrastructure strategy and\nWhole of Government ICT Strategic directions.\nThis section outlines:\n• the initiatives that are being delivered in this stage of the ICT\nStrategic Plan (2006-2011)\n• initiatives scheduled for the second phase of the 10 year plan,\nbetween 2012 and 2016.\n7.1 Clinical Systems Strategy\n7.1.1 Objective\nThe Clinical Systems Strategy will implement the core clinical systems\nneeded to underpin the Clinical Services Redesign Program, Quality and\nSafety initiatives and clinical program areas.\nThe focus will be on systems to improve communication, minimise delays,\nreduce handover problems and support the patient journey. Systems will\nsupport the flexible allocation of resources to ensure services meet patient\nneeds.","Facts":"The Clinical Systems Strategy aims to implement essential clinical systems supporting Clinical Services Redesign, Quality and Safety initiatives, and clinical programs. It focuses on improving communication, reducing delays, and supporting patient care, ensuring resources are allocated flexibly to meet patient needs","Factors":"Strategic alignment\nProject prioritization\nResource allocation","Groups":"Business Alignment\nProgram and Project Management\nBusiness Alignment","Sub Groups":"Strategic Cohesion\nStrategic Project Leadership\nStrategic Cohesion","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":61,"References":"Page 39","Extracts":"7.1.2 Programs supporting this strategy\nThree programs support the Clinical Systems Strategy. These are:\n• Electronic Medical Record program to implement the core\ndepartmental systems needed to manage patients effectively in an\nacute environment.\n• Primary, Community and Outpatient Care program to implement\nthe infrastructure and systems to support patient care in the\ncommunity, outpatient and primary care environment. It includes\nreferrals and interaction with other human services, and the pilot for\nthe Electronic Health Record program.\n• Clinical Support program to implement core support systems such\nas Patient Administration systems and diagnostic systems.","Facts":"Three programs support the Clinical Systems Strategy: the Electronic Medical Record program for managing patients in hospitals, the Primary, Community, and Outpatient Care program for community care, and the Clinical Support program for essential support systems like Patient Administration and diagnostics.","Factors":"Project prioritization\nIntegration capabilities\nSystem compatibility","Groups":"Program and Project Management\nSystem Deployment and Integration\nStandardization and Streamlining Processes","Sub Groups":"Strategic Project Leadership\nReliable Implementation\nConsistent Excellence","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":62,"References":"Page 42","Extracts":"7.2 Corporate Systems Strategy\n7.2.1 Objective\nThe Corporate Systems Strategy will implement the core systems needed\nto underpin the Corporate Shared Services reform program. This program\naims to reduce the duplication and cost in administrative functions to\nincrease funds available for frontline care. This strategy is underpinned by\nthe Corporate Systems program.","Facts":"The Corporate Systems Strategy sets up essential systems to support the Corporate Shared Services reform program, cutting duplication and costs in administrative tasks to redirect funds to frontline care, with the Corporate Systems program as its backbone.","Factors":"Integration capabilities\nProcess efficiency\nData integrity & privacy\nSecure data practices","Groups":"System Deployment and Integration\nOperational Effectiveness and Efficiency\nData Security, Quality and Privacy\nData Security, Quality and Privacy","Sub Groups":"Reliable Implementation\nProcess optimization\nData integrity\nData integrity","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":63,"References":"Page 43","Extracts":"7.3 Business Information Strategy\n7.3.1 Objectives\nThe Business Information Strategy aims to make a core set of high quality\ninformation available at all levels of the organisation in a timely manner\nand to develop a performance culture around it. This has the potential to\ntransform operational data into management insight, and support decisions\nthat drive real results for the Department and its stakeholders. Business\ninformation must integrate NSW health’s strategic objectives with front line\nservice delivery, drive management accountability and be driven by the\noverall program and change management approach","Facts":"The Business Information Strategy aims to provide timely, high-quality information throughout the organization, fostering a performance-driven culture. It helps turn data into insights, supports decision-making, aligns with strategic goals, ensures accountability, and follows the overall program and change management approach.","Factors":"Performance monitoring\nData management\nPerformance monitoring\nIntegration capabilities\nUnified platforms\nData sharing & integration\nData integrity & privacy","Groups":"System Maintenance and Support\nData and Information Management\nSystem Maintenance and Support\nSystem Deployment and Integration\nSystem Deployment and Integration\nData and Information Management\nData Security, Quality and Privacy","Sub Groups":"Responsive Support\nData governance\nResponsive Support\nReliable Implementation\nReliable Implementation\nData governance\nData integrity","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary\nIn Glossary\nIn Glossary\nIn Glossary\nIn Glossary"},{"ID":64,"References":"Page 43","Extracts":"7.3.2 Programs supporting this strategy\nThere are three major programs under the Business Information Strategy.\nThese are:\nCreate value for\ndecision makers at\nthe front line\nThe primary aim of this program is to provide\ntimely, relevant information in a user friendly way\nto clinicians and decision makers in front line\nservices.\nGovernance and\nperformance\nmanagement\nAimed at integrating NSW Health’s strategic and\nplanning frameworks and developing overall\nvalue and cost effectiveness performance\nmeasures.\nEnabling\ninfrastructure and\nsupport\nMaking sure that the source systems are capable\nof providing the major indicators, that the data\nsets are standardised and implemented to\nprovide consistent information and the technical\ninfrastructure is in place","Facts":"Three programs support the Business Information Strategy: one delivers useful information to front-line staff, another integrates strategic frameworks and develops performance measures, and the third ensures systems can provide consistent data and sets up technical infrastructure","Factors":"Project prioritization\nStrategic alignment\nPerformance monitoring","Groups":"Program and Project Management\nBusiness Alignment\nSystem Maintenance and Support","Sub Groups":"Strategic Project Leadership\nStrategic Cohesion\nResponsive Support","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":65,"References":"Page 44","Extracts":"7.4 Sustainable infrastructure program\n7.4.1 Objectives\nThis program aims to rationalise the technical infrastructure and develop\nand maintain standards and architecture needed to support state wide ICT\ninitiatives and to ensure the maximum benefit is gained from the\ninvestment in ICT.","Facts":"The Sustainable Infrastructure program aims to streamline technical infrastructure, establish and uphold standards and architecture for statewide ICT initiatives, and ensure maximum benefit from ICT investments.","Factors":"Infrastructure efficiency\nStandardization\nResource allocation","Groups":"Infrastructure and Hardware Management\nOperational Effectiveness and Efficiency\nBusiness Alignment","Sub Groups":"Sustainable Systems\nProcess optimization\nStrategic Cohesion","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"},{"ID":66,"References":"Page 44","Extracts":"7.4.2 Programs supporting this strategy\nThe infrastructure strategy incorporates the following programs:\nInfrastructure Defining and implementing the\ntelecommunications and technical infrastructure\nto support the clinical and corporate strategies.\nArchitecture and\nStandards\nProviding the enterprise architecture enterprise\nintegration layer and core technical standards\nrequired to manage NSW information assets.\nInformation\nmanagement\nEnsuring that uniform data standards are\ndeveloped and applied across state based builds\nand other systems as appropriate and that data\nquality strategies are in place to ensure\nmaximum value from the information collected\nacross NSW.","Facts":"The Sustainable Infrastructure program includes three parts: setting up infrastructure, establishing technical standards, and ensuring uniform data standards across systems in NSW.","Factors":"Infrastructure efficiency\nStandardization\nData integrity & privacy","Groups":"Infrastructure and Hardware Management\nOperational Effectiveness and Efficiency\nData Security, Quality and Privacy","Sub Groups":"Sustainable Systems\nProcess optimization\nData integrity","Notes\/Additional":null,"Glossary Check":"In Glossary\nIn Glossary\nIn Glossary"}]